dotfiles/_emacs.d/init.el
;; This is bdwalton's emacs config. It is auto-generated from init.org.
;; Local changes will be overwritten.

;; Wire up straight.el; We use that instead of package. Note that
;; early-init.el should be force disabling package as well.
(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(setq package-enable-at-startup nil)

;; Any functions we need to use during init.
(defun bdw-frame-creation-hook (&optional frame)
  "Do frame-type-conditional setup."
  (with-selected-frame frame
    (if (display-graphic-p)
        (progn
          (custom-set-faces
           ;; custom-set-faces was added by Custom.
           ;; If you edit it by hand, you could mess it up, so be careful.
           ;; Your init file should contain only one such instance.
           ;; If there is more than one, they won't work right.
           '(default ((t (:family "Liberation Mono" :foundry "PfEd" :slant normal :weight normal :height 109 :width normal)))))
          (scroll-bar-mode -1)
          (tool-bar-mode -1)))))

;; Help with colorizing compilation buffers.
(defun bdw/advice-compilation-filter (f proc string)
  (funcall f proc (xterm-color-filter string)))

;; Everything else we want to do via use-package, but to ensure that
;; boostraps, use straight directly for it.
(straight-use-package 'use-package)

;; Now, teach straight to integrate itself cleanly into use-package by
;; default.
(use-package straight
  :custom
  (straight-use-package-by-default t))

(use-package emacs
  :bind
  ;; General keybindings here
  (("C-x k" . 'kill-this-buffer)
   ("C-x m" . 'execute-extended-command)
   ("C-c C-c" . 'comment-or-uncomment-region)
   ;; macros with 1 key
   ("<f4>" .  'start-kbd-macro)
   ("<f5>" . 'end-kbd-macro)
   ("<f6>" . 'call-last-kbd-macro))
  :config
  ;; Our basic config overrides and default settings
  (add-hook 'after-make-frame-functions 'bdw-frame-creation-hook)
  (setq inhibit-startup-message t)
  (menu-bar-mode -1)
  (column-number-mode t)         ;; show column numbers
  (fset 'yes-or-no-p 'y-or-n-p)
  (global-font-lock-mode t)      ;; always have font colouring
  ;; enable a few deprecated features that we like
  (put 'narrow-to-region 'disabled nil)
  (put 'upcase-region 'disabled nil)
  (setq default-tab-width 2)
  (setq make-backup-files nil)   ;; stop the little ~ turd files
  ;; Dump anything managed via custom-set* in a separate file
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file))

;; Enable vertico, which provides a minimalistic vertical completion UI.
(use-package vertico
  :init
  (vertico-mode)
  ;; Show more candidates
  (setq vertico-count 15)
  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (setq vertico-cycle t)
  )

;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

(use-package consult-projectile
  :straight (consult-projectile :type git :host gitlab :repo "OlMon/consult-projectile" :branch "master"))
