dotfiles/_emacs.d/init.org
*** Helpful

  This package provides, as it says on the tin, helpful functions
  for doing things like prompting with available next-key when
  you're part way through a sequence, etc.

#+begin_src emacs-lisp
  
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

*** Which Key

#+begin_src emacs-lisp
  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode))
#+end_src

*** Term Title

I often use emacs from a terminal, so this ensures the terminal
displays a proper title.

#+begin_src emacs-lisp
  (use-package term-title
    :straight
    (term-title :type git :host github :repo "CyberShadow/term-title" )
    :config
    (term-title-mode))
#+end_src

*** Goto Line Faster

#+begin_src emacs-lisp
  (use-package goto-line-faster
    :straight
    (goto-line-faster :type git :host github :repo "davep/goto-line-faster.el" ))
#+end_src

*** Project
Eglot requires some of the foundations from project but doesn't pull
it in nicely via straight. Ensure it's available so eglot finds what
it needs.

#+begin_src emacs-lisp
  (use-package project)
#+end_src

*** Projectile

This mode provides many nice things for working on repositories as
units of files.

#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :bind (:map projectile-mode-map
                ("C-x p" . projectile-command-map)
                ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
                ("C-x p f" . consult-project-buffer)
                )
    :config
    (projectile-mode)
    :custom
    (projectile-switch-project-action #'consult-project-buffer)
    (projectile-project-search-path
     '(("~/working_code/" . 1)
       ("~/working_code/go/src/github.com/bdwalton/" . 1))))
#+end_src

*** Midnight Mode

Auto-clean old buffers overnight.

#+begin_src emacs-lisp
  (use-package midnight ; enable midnight mode buffer purging
    :config
    (midnight-delay-set 'midnight-delay "4:30am"))
#+end_src

*** Editorconfig

This enables consuming certain standardized config files from project
repositories, which makes things like enforcing some coding standards
easier.

#+begin_src emacs-lisp
  (use-package editorconfig
    :diminish
    :config
    (editorconfig-mode 1))
#+end_src

*** XTerm Color

We pull this in because we can use it with the compilation mode buffer
to get better handling of ansi escape sequences used to colorize
strings.

#+begin_src emacs-lisp
  (use-package xterm-color
    :custom
    (compilation-environment '("TERM=xterm-256color"))
    :config
    (advice-add 'compilation-filter :around #'bdw/advice-compilation-filter))
#+end_src

** Programming Related Packages And Config

The packages below make programming nicer by enhancing the experience
with things like bracket matching and colouring, git integration, auto
indentation etc.

*** Magit

#+begin_src emacs-lisp
  ;; Programming related packages and config
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

*** Apheleia

#+begin_src emacs-lisp
  (use-package apheleia
    :diminish
    :config
    (apheleia-global-mode +1))
#+end_src

*** Smartparens

#+begin_src emacs-lisp
  (use-package smartparens
    :diminish
    :init
    (require 'smartparens-config)
    :hook
    (prog-mode . smartparens-mode)
    :config
    (show-smartparens-global-mode t)
    :custom
    (smartparens-strict-mode t))
#+end_src

*** Rainbow Delimiters


#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Tree Sitter

#+begin_src emacs-lisp
  (use-package tree-sitter
    :diminish
    :hook
    ((tree-sitter-after-on . tree-sitter-hl-mode)
     ((go-mode typescript-mode) . tree-sitter-hl-mode)))
#+end_src

*** Tree Sitter Languages

#+begin_src emacs-lisp
  ;; Various modes that we find useful

  (use-package tree-sitter-langs
    :after tree-sitter)
#+end_src

*** Company Mode
This enables some rich programming completion UIs

#+begin_src emacs-lisp
  ;; Some text completion UIs that make programming experiences richer.
  (use-package company
    :diminish
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    :init
    (add-hook 'go-mode-hook #'company-mode))
#+end_src

*** Yasnippet

Use the yasnippet library to provide snippet completion for
eglot. Must be loaded before eglot.

#+begin_src emacs-lisp
  (use-package yasnippet
    :diminish yas-minor-mode
    :config
    (yas-global-mode 1))
#+end_src

*** Eglot

Setup eglot for nice LSP integration in various coding modes.

#+begin_src emacs-lisp
  (use-package eglot
    :after yasnippet
    :config
    (add-hook 'go-mode-hook #'eglot-ensure))
#+end_src

** Useful Modes For Coding and Editing Configs

Make sure we have programming and config modes for commonly used
languages and files.

*** Go Mode

#+begin_src emacs-lisp
  (use-package go-mode)
#+end_src

*** Rust Mode

#+begin_src emacs-lisp
  (use-package rust-mode)
#+end_src

*** i3 Config Mode
This works for sway config too as they're almost identical.

#+begin_src emacs-lisp
  (use-package i3wm-config-mode)
#+end_src

*** Ini File Mode

#+begin_src emacs-lisp
  (use-package ini-mode
    :straight
    (ini-mode type: git :host github :repo "Lindydancer/ini-mode" )
    :config
    (ini-mode))
#+end_src

*** JSON Mode
Provide nice capabilities and highlighting for JSON files.

#+begin_src emacs-lisp
(use-package json-mode)
#+end_src

*** Markdown File Mode
#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode ("README\\.md" . gfm-mode))   ;; gfm == GitHub Flavored Markdown
#+end_src
  
*** Systemd Unit Config Mode

#+begin_src emacs-lisp
  (use-package systemd
    :config
    (systemd-mode))
#+end_src

*** Typescript Mode

We're working with nodejs stuff these days and writing some ts for
frontend UIs.

#+begin_src emacs-lisp
  (use-package typescript-mode)
#+end_src

*** Yaml Mode

YAML files are common enough that it's nice to have a dedicated mode
for them.
#+begin_src emacs-lisp
  (use-package yaml-mode
    :init
    (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
    :bind (("C-m" . 'newline-and-indent)))
#+end_src

*** Protobuf mode

Support for editting protocol buffer definitions.

#+begin_src emacs-lisp
  (use-package protobuf-mode)
#+end_src
** Org Mode Config

We use org mode with several enhancements. All of the org-related
config is below.

*** Org Mode
#+begin_src emacs-lisp
  ;; All of our org-mode related config
  (use-package org
    :config
    (require 'org-tempo) ;; Needed after org 9.2
    (add-hook 'org-tab-first-hook 'org-end-of-line)
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)))
    :custom
    (org-ellipsis " ▾")
    (org-hide-emphasis-markers t)
    (org-log-done 'time)
    (org-agenda-start-with-log-mode t)
    (org-startup-indented t))
#+end_src

*** Org Bullets

#+begin_src emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

*** Org Auto Tangle

#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :diminish
    :after org
    :straight
    (org-auto-tangle type: git :host github :repo "yilkalargaw/org-auto-tangle" )
    :defer t
    :hook (org-mode . org-auto-tangle-mode))
#+end_src

* Custom Set Variables and Faces
We store this in a separate file. It will be version controlled for
completeness, but because we don't curate this by hand, we keep it out
of the main init.el.

#+begin_src emacs-lisp :tangle ./custom.el
  
  ;; These are both manipulated automatically. Don't hand curate them.
  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   )

  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   )
#+end_src

* Optional Site/Machine Specific Config
#+begin_src emacs-lisp
  ;; Now pull in the optional site-local config
  (setq site-local-lib
        (concat
         (file-name-directory #$)
         (concat "emacs-" (getenv "BDW_CONFIG_TYPE") ".el")))
  (when (file-readable-p site-local-lib)
    (load-library site-local-lib))
#+end_src

* Final Setup Actions
#+begin_src emacs-lisp
  ;; finally, always start with ~/ as the current directory
  (cd (getenv "HOME"))
#+end_src

* Org Metadata

This isn't output to the config, but captures metadata that is used by
org mode to control various properties.

#+auto_tangle: t
#+property: header-args:emacs-lisp :tangle ./init.el
#+startup: show3levels
