dotfiles/_emacs.d/init.el

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package which-key
  :diminish which-key-mode
  :config
  (which-key-mode))

(use-package term-title
  :straight
  (term-title :type git :host github :repo "CyberShadow/term-title" )
  :config
  (term-title-mode))

(use-package goto-line-faster
  :straight
  (goto-line-faster :type git :host github :repo "davep/goto-line-faster.el" ))

(use-package project)

(use-package projectile
  :diminish projectile-mode
  :bind (:map projectile-mode-map
              ("C-x p" . projectile-command-map)
              ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
              ("C-x p f" . consult-project-buffer)
              )
  :config
  (projectile-mode)
  :custom
  (projectile-switch-project-action #'consult-project-buffer)
  (projectile-project-search-path
   '(("~/working_code/" . 1)
     ("~/working_code/go/src/github.com/bdwalton/" . 1))))

(use-package midnight ; enable midnight mode buffer purging
  :config
  (midnight-delay-set 'midnight-delay "4:30am"))

(use-package editorconfig
  :diminish
  :config
  (editorconfig-mode 1))

(use-package xterm-color
  :custom
  (compilation-environment '("TERM=xterm-256color"))
  :config
  (advice-add 'compilation-filter :around #'bdw/advice-compilation-filter))

;; Programming related packages and config
(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package apheleia
  :diminish
  :config
  (apheleia-global-mode +1))

(use-package smartparens
  :diminish
  :init
  (require 'smartparens-config)
  :hook
  (prog-mode . smartparens-mode)
  :config
  (show-smartparens-global-mode t)
  :custom
  (smartparens-strict-mode t))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package tree-sitter
  :diminish
  :hook
  ((tree-sitter-after-on . tree-sitter-hl-mode)
   ((go-mode typescript-mode) . tree-sitter-hl-mode)))

;; Various modes that we find useful

(use-package tree-sitter-langs
  :after tree-sitter)

;; Some text completion UIs that make programming experiences richer.
(use-package company
  :diminish
  :bind
  (:map company-active-map
        ("<tab>" . company-complete-selection))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0)
  :init
  (add-hook 'go-mode-hook #'company-mode))

(use-package yasnippet
  :diminish yas-minor-mode
  :config
  (yas-global-mode 1))

(use-package eglot
  :after yasnippet
  :config
  (add-hook 'go-mode-hook #'eglot-ensure))

(use-package go-mode)

(use-package rust-mode)

(use-package i3wm-config-mode)

(use-package ini-mode
  :straight
  (ini-mode type: git :host github :repo "Lindydancer/ini-mode" )
  :config
  (ini-mode))

(use-package json-mode)

(use-package markdown-mode
  :mode ("README\\.md" . gfm-mode))   ;; gfm == GitHub Flavored Markdown

(use-package systemd
  :config
  (systemd-mode))

(use-package typescript-mode)

(use-package yaml-mode
  :init
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
  :bind (("C-m" . 'newline-and-indent)))

(use-package protobuf-mode)

;; All of our org-mode related config
(use-package org
  :config
  (require 'org-tempo) ;; Needed after org 9.2
  (add-hook 'org-tab-first-hook 'org-end-of-line)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))
  :custom
  (org-ellipsis " ▾")
  (org-hide-emphasis-markers t)
  (org-log-done 'time)
  (org-agenda-start-with-log-mode t)
  (org-startup-indented t))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(use-package org-auto-tangle
  :diminish
  :after org
  :straight
  (org-auto-tangle type: git :host github :repo "yilkalargaw/org-auto-tangle" )
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

;; Now pull in the optional site-local config
(setq site-local-lib
      (concat
       (file-name-directory #$)
       (concat "emacs-" (getenv "BDW_CONFIG_TYPE") ".el")))
(when (file-readable-p site-local-lib)
  (load-library site-local-lib))

;; finally, always start with ~/ as the current directory
(cd (getenv "HOME"))
